Hotakus/mp3-lvgl-stm32f405rgt/driver/screen/lcd_144_st7735/lcd_144_st7735.h
#ifndef LCD_144_ST7735_144_H
#define LCD_144_ST7735_144_H

#ifdef __cplusplus
extern "C" {
#endif

/* includes */
#include "stm32f4xx_conf.h"
#include "systick.h"

/* definations */

#define LCD_144_ST7735_SPI         SPI2

#define LCD_144_ST7735_CS           GPIO_Pin_12     // PB12
#define LCD_144_ST7735_RST          GPIO_Pin_14     // PB14
#define LCD_144_ST7735_DC           GPIO_Pin_6      // PC6
#define LCD_144_ST7735_BLK          GPIO_Pin_7      // PC7


#define	LCD_144_ST7735_CS_SET  	 GPIOB->BSRRL |= LCD_144_ST7735_CS
#define	LCD_144_ST7735_CS_CLR  	 GPIOB->BSRRH |= LCD_144_ST7735_CS

#define	LCD_144_ST7735_RST_SET  	 GPIOB->BSRRL |= LCD_144_ST7735_RST
#define	LCD_144_ST7735_RST_CLR  	 GPIOB->BSRRH |= LCD_144_ST7735_RST

#define	LCD_144_ST7735_DC_SET  	 GPIOC->BSRRL |= LCD_144_ST7735_DC  
#define	LCD_144_ST7735_DC_CLR  	 GPIOC->BSRRH |= LCD_144_ST7735_DC

#define	LCD_144_ST7735_BLK_SET  	 GPIOC->BSRRL |= LCD_144_ST7735_BLK
#define	LCD_144_ST7735_BLK_CLR  	 GPIOC->BSRRH |= LCD_144_ST7735_BLK


/* function */
void lcd_gpio( void );
void lcd_init( void );

u8 lcd_trans_byte( u8 byte );
void lcd_trans_half( u16 half );

void lcd_send_cmd( u8 cmd );
void lcd_send_dat( u8 dat );

void lcd_reset(void);
void lcd_powerUp( void );
void lcd_powerDown( void );

void lcd_setRegion(u16 xs, u16 ys, u16 xe, u16 ye);
void lcd_setPos( u16 x, u16 y );
void lcd_clear(u16 color);

void lcd_drawPoint( u16 x, u16 y, u16 color );

#ifdef __cplusplus
}
#endif

#endif
